Repository: AvtsynovS/investment_assistant
Catalog: lib/src/localizations/l10n/app_*.arb
Languages: ru

# welcomeTitle
source: Welcome to Investment assistant
ru: Добро пожаловать в Инвестиционный помощник

# welcomeBody
source: Please login to your account or create new account to continue
ru: Пожалуйста, войдите в свою учетную запись или создайте новую, чтобы продолжить

# loginUserNamePlaceholder
source: Enter your User name
ru: Введите свое имя

# loginPasswordPlaceholder
source: Enter your password
ru: Введите пароль

# loginConfirmPasswordPlaceholder
source: Confirm your Password
ru: Подтвердите ваш пароль

# loginMessage
source: Don`t have an account?
ru: Нет аккаутна?

# registrationMessage
source: Already have an account?
ru: Уже есть аккаунт?

# loginMessageError
source: Wrong login or password
ru: Неверный логин или пароль

# loginUserNameErrorMessage
source: Please enter your Username
ru: Пожалуйста введите имя

# loginPasswordErrorMessage
source: Please enter your password
ru: Пожалуйста введите пароль

# confirmPasswordErrorMessage
source: Wrong password
ru: Неверный пароль

# mainTitle
source: Investment Assistant
ru: Инвестиционный помощник

# dealsTitle
source: Deals
ru: Сделки

# ratesTitle
source: Rates
ru: Тарифы

# historyTitle
source: History
ru: История

# settingsTitle
source: Settings
ru: Настройки

source: Profile
ru: Профиль

source: Change language
ru: Сменить язык

source: Change theme
ru: Сменить тему

source: Delete profile
ru: Удалить профиль

# exitInApp
source: Exit
ru: Выйти

source: English
ru: Английский

source: Russian
ru: Русский

# defaultName
source: Investor
ru: Инвестор

source: Active rate:
ru: Активный тариф:

source: Change Name
ru: Сменить имя

source: Change password
ru: Сменить пароль

source: Change rate
ru: Сменить тариф

source: Login
ru: Логин

# userNameFieldLabel
source: User name
ru: Имя

# passwordFieldLabel
source: Password
ru: Пароль

# confirmPasswordFieldLabel
source: Confirm Password
ru: Подтвердите пароль

source: Create account
ru: Создать аккаутн

source: Registration
ru: Регистрация

source: Cancel
ru: Отмена

source: OK
ru: ОК

source: Edit
ru: Редактировать

source: Yes
ru: Да

source: No
ru: Нет

# exitModalMessage
source: Do you really want to go out?
ru: Вы точно хотите выйти?

# deleteProfileModalMessage
source: Are you sure you want to delete your profile? All data will be lost!
ru: Вы точно хотите удалить профиль? Все данные будут потеряны!

# dealTitlePlaceholder
source: Enter your deal title
ru: Введите название актива

# dealPricePlaceholder
source: Enter price deal
ru: Введите цену актива

# dealQuantityPlaceholder
source: Enter quantity
ru: Введите количество

# searchDealPlaceholder
source: Search deal...
ru: Поиск сделки...

# emptySearchDeal
source: No deals found
ru: Ни одной сделки не найдено

# firstDealTitleBtn
source: Make your first deal!
ru: Создайте свою первую сделку!

# addDealTitleBtn
source: Add new deal
ru: Добавить новую сделку

# updateDealTitleBtn
source: Update deal
ru: Обновить сделку

# deleteDealTitle
source: Delete deal
ru: Удалить сделку

# deleteDealDescription
source: Are you sure you want to delete the deal?
ru: Вы уверены, что хотите удалить сделку?

source: Quantity
ru: Количество

source: rub
ru: руб

source: Buy
ru: Покупка

source: Sell
ru: Продажа

source: Stock
ru: Акция

source: Pound
ru: Облигация

source: Dividends
ru: Дивиденды

source: Coupons
ru: Купоны

source: Title deal
ru: Название сделки

# typeDeal
source: Deal Type
ru: Тип сделки

source: Yield
ru: Прибыль

# dividendsSum
source: Enter dividend amount
ru: Введите сумму дивидендов

# couponsSum
source: Enter coupon amount
ru: Введите сумму купонов

# sellTitle
source: Selling price
ru: Цена продажи

# sellPlaceholder
source: Enter the selling price
ru: Введите цену продажи

# titleDealError
source: Please enter deal title
ru: Пожалуйста введите название актива

# buyDealError
source: Please enter buy price
ru: Пожалуйста введите цену

# quantityDealError
source: Please enter quantity
ru: Пожалуйста введите количество

# rateTitlePlaceholder
source: Enter the name of the tariff
ru: Введите название тарифа

# transactionCommissionPlaceholder
source: Enter commission per trade
ru: Введите комиссию за сделку

# searchRatePlaceholder
source: Search rate...
ru: Поиск тарифа...

# emptySearchRate
source: No rates found
ru: Ни одного тарифа не найдено

# firstRateTitleBtn
source: Create your first rate!
ru: Создайте свой первый тариф!

# addRateTitleBtn
source: Add new tariff
ru: Добавить новый тариф

# updateRateTitleBtn
source: Update tariff
ru: Обновить тариф

# deleteRateTitle
source: Delete tariff
ru: Удалить тариф

# deleteRateDescription
source: Are you sure you want to remove the tariff?
ru: Вы уверены, что хотите удалить тариф?

# changeRateTitle
source: Change tariff
ru: Сменить тариф

# changeRateDescription
source: Make this tariff active?
ru: Сделать этот тариф активным?

# rateTitle
source: Tariff name
ru: Название тарифа

source: Commission
ru: Комиссия

source: Activate rate
ru: Активировать тариф

source: Monthly commission
ru: Ежемесячная комиссия

# monthlyCommissionPricePlaceholder
source: Enter monthly commission
ru: Введите ежемесячную комиссию

# monthlyCommissionRateError
source: Please enter the amount of the monthly commission
ru: Пожалуйста введите сумму ежемесячной комиссии

source: Rate error
ru: Ошибка тарифа

# rateErrorDescription
source: Please select an active tariff
ru: Пожалуйста выберите активный тариф

# rateTitleError
source: Please enter the name of the tariff
ru: Пожалуйста введите название тарифа

# transactionCommissionRateTitle
source: Commission for deal
ru: Комиссия за сделку

# transactionCommissionRateError
source: Please enter the transaction fee
ru: Пожалуйста введите комиссию за сделку

# historyEmptyText
source: The history of closed transactions will be displayed here
ru: Здесь будет отображаться история по закрытым сделкам

# searchHistoryPlaceholder
source: Search deal...
ru: Поиск сделки...

# emptySearchHistory
source: No deals found
ru: Ни одной сделки не найдено

# changePasswordPageTitle
source: Change Password
ru: Смена пароля

# oldPasswordFieldTitle
source: Enter old password
ru: Введите старый пароль

# oldPasswordFieldPlaceholder
source: Enter old password
ru: Введите старый пароль

# newPasswordFieldTitle
source: Enter new password
ru: Введите новый пароль

# newPasswordFieldPlaceholder
source: Enter new password
ru: Введите новый пароль

# confirmPasswordFieldTitle
source: Confirm password
ru: Подтвержите пароль

# confirmPasswordFieldPlaceholder
source: Confirm password
ru: Подтвержите пароль

# requiredFieldError
source: Requared field
ru: Поле обязательно для заполнения

# changeCurrentPasswordError
source: he current password is not suitable
ru: Текущий пароль не подходит

# changeSamePasswordError
source: The old and new passwords are the same
ru: Старый и новый пароль совпадают

# changeConfirmPasswordError
source: Password doesn't match
ru: Пароль не совпадает

# changeLoginPageTitle
source: Change Login
ru: Смена логина

# oldLoginFieldTitle
source: Enter old login
ru: Введите старый логин

# oldLoginFieldPlaceholder
source: Enter old login
ru: Введите старый логин

# newLoginFieldTitle
source: Enter new login
ru: Введите новый логин

# newLoginFieldPlaceholder
source: Enter new login
ru: Введите новый логин

# changeSameLoginError
source: Old and new login are the same
ru: Старый и новый логин совпадают

# changeCurrentLoginError
source: he current login is not suitable
ru: Текущий логин не подходит
